[
  {
    "pmid": 36483928,
    "title": "The role of reinforcement learning and value-based decision-making frameworks in understanding food choice and eating behaviors.",
    "abstract": "The obesogenic food environment includes easy access to highly-palatable, energy-dense, \"ultra-processed\" foods that are heavily marketed to consumers; therefore, it is critical to understand the neurocognitive processes the underlie overeating in response to environmental food-cues (e.g., food images, food branding/advertisements). Eating habits are learned through reinforcement, which is the process through which environmental food cues become valued and influence behavior. This process is supported by multiple behavioral control systems (e.g., Pavlovian, Habitual, Goal-Directed). Therefore, using neurocognitive frameworks for reinforcement learning and value-based decision-making can improve our understanding of food-choice and eating behaviors. Specifically, the role of reinforcement learning in eating behaviors was considered using the frameworks of (1) Sign-versus Goal-Tracking Phenotypes; (2) Model-Free versus Model-Based; and (3) the Utility or Value-Based Model. The sign-and goal-tracking phenotypes may contribute a mechanistic insight on the role of food-cue incentive salience in two prevailing models of overconsumption-the Extended Behavioral Susceptibility Theory and the Reactivity to Embedded Food Cues in Advertising Model. Similarly, the model-free versus model-based framework may contribute insight to the Extended Behavioral Susceptibility Theory and the Healthy Food Promotion Model. Finally, the value-based model provides a framework for understanding how all three learning systems are integrated to influence food choice. Together, these frameworks can provide mechanistic insight to existing models of food choice and overconsumption and may contribute to the development of future prevention and treatment efforts."
  },
  {
    "pmid": 37329635,
    "title": "Identifying Young Adults at High Risk for Weight Gain Using Machine Learning.",
    "abstract": "Weight gain among young adults continues to increase. Identifying adults at high risk for weight gain and intervening before they gain weight could have a major public health impact. Our objective was to develop and test electronic health record-based machine learning models to predict weight gain in young adults with overweight/class 1 obesity. Seven machine learning models were assessed, including three regression models, random forest, single-layer neural network, gradient-boosted decision trees, and support vector machine (SVM) models. Four categories of predictors were included: 1) demographics; 2) obesity-related health conditions; 3) laboratory data and vital signs; and 4) neighborhood-level variables. The cohort was split 60:40 for model training and validation. Area under the receiver operating characteristic curves (AUC) were calculated to determine model accuracy at predicting high-risk individuals, defined by ≥ 10% total body weight gain within 2 y. Variable importance was measured via generalized analysis of variance procedures. Of the 24,183 patients (mean [SD] age, 32.0 [6.3] y; 55.1% females) in the study, 14.2% gained ≥10% total body weight. Area under the receiver operating characteristic curves varied from 0.557 (SVM) to 0.675 (gradient-boosted decision trees). Age, sex, and baseline body mass index were the most important predictors among the models except SVM and neural network. Our machine learning models performed similarly and had modest accuracy for identifying young adults at risk of weight gain. Future models may need to incorporate behavioral and/or genetic information to enhance model accuracy."
  },
  {
    "pmid": 31972203,
    "title": "Mapping sign-tracking and goal-tracking onto human behaviors.",
    "abstract": "As evidenced through classic Pavlovian learning mechanisms, environmental cues can become incentivized and influence behavior. These stimulus-outcome associations are relevant in everyday life but may be particularly important for the development of impulse control disorders including addiction. Rodent studies have elucidated specific learning profiles termed 'sign-tracking' and 'goal-tracking' which map onto individual differences in impulsivity and other behaviors associated with impulse control disorders' etiology, course, and relapse. Whereas goal-trackers are biased toward the outcome, sign-trackers fixate on features that are associated with but not necessary for achieving an outcome; a pattern of behavior that often leads to escalation of reward-seeking that can be maladaptive. The vast majority of the sign- and goal-tracking research has been conducted using rodent models and very few have bridged this concept into the domain of human behavior. In this review, we discuss the attributes of sign- and goal-tracking profiles, how these are manifested neurobiologically, and how these distinct learning styles could be an important tool for clinical interventions in human addiction."
  },
  {
    "pmid": 40287020,
    "title": "To what extent do EEG measures reflect performance in perceptual tests?",
    "abstract": "In many studies, EEG measures reflect performance in visual and cognitive tests, as determined by averages across different conditions or groups of participants. Based on these results, one might expect that there is also a significant correlation between performance and EEG measures at the individual level. In this study, we tested young and older adults with three visual tests while recording EEG. We analyzed 13 EEG measures, which were shown to reflect specific aspects of visual processing. Surprisingly, correlations between visual performance and the EEG measures were weak. Even more surprisingly, the EEG measures were highly correlated within participants. Our findings suggest that commonly used EEG measures mainly represent stable traits of participants rather than performance in the tests."
  },
  {
    "pmid": 28192106,
    "title": "Blaming the Brain for Obesity: Integration of Hedonic and Homeostatic Mechanisms.",
    "abstract": "The brain plays a key role in the controls of energy intake and expenditure, and many genes associated with obesity are expressed in the central nervous system. Technological and conceptual advances in both basic and clinical neurosciences have expanded the traditional view of homeostatic regulation of body weight by mainly the hypothalamus to include hedonic controls of appetite by cortical and subcortical brain areas processing external sensory information, reward, cognition, and executive functions. Hedonic controls interact with homeostatic controls to regulate body weight in a flexible and adaptive manner that takes environmental conditions into account. This new conceptual framework has several important implications for the treatment of obesity. Because much of this interactive neural processing is outside awareness, cognitive restraint in a world of plenty is made difficult and prevention and treatment of obesity should be more rationally directed to the complex and often redundant mechanisms underlying this interaction."
  },
  {
    "pmid": 27498406,
    "title": "Training motor responses to food: A novel treatment for obesity targeting implicit processes.",
    "abstract": "The present review first summarizes results from prospective brain imaging studies focused on identifying neural vulnerability factors that predict excessive weight gain. Next, findings from cognitive psychology experiments evaluating various interventions involving food response inhibition training or food response facilitation training are reviewed that appear to target these neural vulnerability factors and that have produced encouraging weight loss effects. Findings from both of these reviewed research fields suggest that interventions that reduce reward and attention region responses to high calorie food cues and increase inhibitory region responses to high calorie food cues could prove useful in the treatment of obesity. Based on this review, a new conceptual model is presented to describe how different cognitive training procedures may contribute to modifying eating behavior and important directions for future research are offered. It is concluded that there is a need for evaluating the effectiveness of more intensive food response training interventions and testing whether adding such training to extant weight loss interventions increases their efficacy."
  },
  {
    "pmid": 39077108,
    "title": "Action Interpretation Determines the Effects of Go/No-Go and Approach/Avoidance Actions on Stimulus Evaluation.",
    "abstract": "Executing go/no-go or approach/avoidance responses toward a stimulus can change its evaluation. To explain these effects, some theoretical accounts propose that executing these responses inherently triggers affective reactions (i.e., action execution), while others posit that the evaluative influences originate from interpreting these responses as valenced actions (i.e., action interpretation). To test the role of action execution and action interpretation in these evaluative effects, we developed a novel training task that combined both go/no-go and approach/avoidance actions orthogonally. Participants either responded or did not respond (i.e., go/no-go) to control a shopping cart on screen, and as a result, either collected or did not collect (i.e., approach/avoidance) certain food items. When the task instructions referred to the go/no-go actions (Experiment 1,"
  },
  {
    "pmid": 31712764,
    "title": "Dissociating neural learning signals in human sign- and goal-trackers.",
    "abstract": "Individuals differ in how they learn from experience. In Pavlovian conditioning models, where cues predict reinforcer delivery at a different goal location, some animals-called sign-trackers-come to approach the cue, whereas others, called goal-trackers, approach the goal. In sign-trackers, model-free phasic dopaminergic reward-prediction errors underlie learning, which renders stimuli 'wanted'. Goal-trackers do not rely on dopamine for learning and are thought to use model-based learning. We demonstrate this double dissociation in 129 male humans using eye-tracking, pupillometry and functional magnetic resonance imaging informed by computational models of sign- and goal-tracking. We show that sign-trackers exhibit a neural reward prediction error signal that is not detectable in goal-trackers. Model-free value only guides gaze and pupil dilation in sign-trackers. Goal-trackers instead exhibit a stronger model-based neural state prediction error signal. This model-based construct determines gaze and pupil dilation more in goal-trackers."
  },
  {
    "pmid": 31430000,
    "title": "Food craving in daily life: comparison of overweight and normal-weight participants with ecological momentary assessment.",
    "abstract": "The present study examined food cravings in daily life by comparing overweight and normal-weight participants right before eating events and at non-eating moments. It was hypothesised that overweight participants would have (i) more frequent, (ii) stronger and (iii) a greater variety of high-caloric palatable food cravings, and also would (iv) consume more high-caloric palatable foods, than normal-weight participants. Ecological momentary assessment (EMA) was used to assess food craving strength and frequency, variety of specific food cravings, and food intake. Fifty-seven overweight and 43 normal-weight adult participants were assessed at eating events and at an average of eight random non-eating moments per day for 2 weeks. Foods were categorised as: high-caloric high palatable foods (HCHP), fruits and salads, staple food dishes and sandwiches, and soups and yoghurts. Overweight participants reported more frequent HCHP food cravings specifically at non-eating moments than did normal-weight participants. Normal-weight participants reported more food cravings for staple foods, specifically at eating events. Moreover, overweight participants craved a greater variety of HCHP foods than normal-weight participants at both eating events and random non-eating moments. No other significant between-group differences were found. The results highlight the importance for obesity interventions (i) to specifically target high-caloric palatable food cravings that are experienced during the day and are not tied to eating moments and (ii) to aim for a reduction in the variety of high-caloric palatable food cravings. It might be fruitful to deliver treatment aimed at reducing cravings via mobile devices because this allows for easy individual tailoring and timing of interventions."
  },
  {
    "pmid": 21681221,
    "title": "Attentional bias to food images associated with elevated weight and future weight gain: an fMRI study.",
    "abstract": "Behavioral studies reveal that obese vs. lean individuals show attentional bias to food stimuli. Yet research has not investigated this relation using objective brain imaging or tested whether attentional bias to food stimuli predicts future weight gain, which are important aims given the prominence of food cues in the environment. We used functional magnetic resonance imaging (fMRI) to examine attentional bias in 35 adolescent girls ranging from lean to obese using an attention network task involving food and neutral stimuli. BMI correlated positively with speed of behavioral response to both appetizing food stimuli and unappetizing food stimuli, but not to neutral stimuli. BMI correlated positively with activation in brain regions related to attention and food reward, including the anterior insula/frontal operculum, lateral orbitofrontal cortex (OFC), ventrolateral prefrontal cortex (vlPFC), and superior parietal lobe, during initial orientation to food cues. BMI also correlated with greater activation in the anterior insula/frontal operculum during reallocation of attention to appetizing food images and with weaker activation in the medial OFC and ventral pallidum during reallocation of attention to unappetizing food images. Greater lateral OFC activation during initial orientation to appetizing food cues predicted future increases in BMI. Results indicate that overweight is related to greater attentional bias to food cues and that youth who show elevated reward circuitry responsivity during food cue exposure are at increased risk for weight gain."
  },
  {
    "pmid": 35915356,
    "title": "Test-retest reliability of a smartphone-based approach-avoidance task: Effects of retest period, stimulus type, and demographics.",
    "abstract": "The approach-avoidance task (AAT) is an implicit task that measures people's behavioral tendencies to approach or avoid stimuli in the environment. In recent years, it has been used successfully to help explain a variety of health problems (e.g., addictions and phobias). Unfortunately, more recent AAT studies have failed to replicate earlier promising findings. One explanation for these replication failures could be that the AAT does not reliably measure approach-avoidance tendencies. Here, we first review existing literature on the reliability of various versions of the AAT. Next, we examine the AAT's reliability in a large and diverse sample (N = 1077; 248 of whom completed all sessions). Using a smartphone-based, mobile AAT, we measured participants' approach-avoidance tendencies eight times over a period of seven months (one measurement per month) in two distinct stimulus sets (happy/sad expressions and disgusting/neutral stimuli). The mobile AAT's split-half reliability was adequate for face stimuli (r = .85), but low for disgust stimuli (r = .72). Its test-retest reliability based on a single measurement was poor for either stimulus set (all ICC1s < .3). Its test-retest reliability based on the average of all eight measurements was moderately good for face stimuli (ICCk = .73), but low for disgust stimuli (ICCk = .5). Results suggest that single-measurement AATs could be influenced by unexplained temporal fluctuations of approach-avoidance tendencies. These fluctuations could be examined in future studies. Until then, this work suggests that future research using the AAT should rely on multiple rather than single measurements."
  },
  {
    "pmid": 18545266,
    "title": "A framework for studying the neurobiology of value-based decision making.",
    "abstract": "Neuroeconomics is the study of the neurobiological and computational basis of value-based decision making. Its goal is to provide a biologically based account of human behaviour that can be applied in both the natural and the social sciences. This Review proposes a framework to investigate different aspects of the neurobiology of decision making. The framework allows us to bring together recent findings in the field, highlight some of the most important outstanding problems, define a common lexicon that bridges the different disciplines that inform neuroeconomics, and point the way to future applications."
  },
  {
    "pmid": 41647266,
    "title": "Sign-tracking bias is associated with the inhibition of motor response to appetitive food cues.",
    "abstract": "Response training, such as with the Go/NoGo task, reduces the value of trained items by requiring participants to repeatedly inhibit their responses to appetitive cues that typically elicit approach tendencies. This devaluation is thought to reflect a reduction in motivational conflict between the cue-driven approach and task demand for response withholding. In this registered report, we examined whether individual differences in Pavlovian learning style, measured via a sign-tracking bias during a separate Pavlovian conditioning task, are associated with the topography of event-related potentials recorded during a food-related Go/NoGo task. We also assessed whether this bias correlates with participants' reaction times and commission errors during the task. We found a covariance between sign-tracking bias and pre-training topographic electrophysiological responses during the P3 ERP component, but no association with training-induced plastic modification. Additionally, we found positive evidence for an absence of relationship between sign-tracking bias and behavioral responses at pre-training ("
  },
  {
    "pmid": 32249207,
    "title": "Improving the Reliability of Computational Analyses: Model-Based Planning and Its Relationship With Compulsivity.",
    "abstract": "Computational models show great promise in mapping latent decision-making processes onto dissociable neural substrates and clinical phenotypes. One prominent example in reinforcement learning is model-based planning, which specifically relates to transdiagnostic compulsivity. However, the reliability of computational model-derived measures such as model-based planning is unclear. Establishing reliability is necessary to ensure that such models measure stable, traitlike processes, as assumed in computational psychiatry. Although analysis approaches affect validity of reinforcement learning models and reliability of other task-based measures, their effect on reliability of reinforcement learning models of empirical data has not been systematically studied. We first assessed within- and across-session reliability and effects of analysis approaches (model estimation, parameterization, and data cleaning) of measures of model-based planning in patients with compulsive disorders (n = 38). The analysis approaches affecting test-retest reliability were tested in 3 large generalization samples (healthy participants: n = 541 and 111; people with a range of compulsivity: n = 1413). Analysis approaches greatly influenced reliability: reliability of model-based planning measures ranged from 0 (no concordance) to above 0.9 (acceptable for clinical applications). The largest influence on reliability was whether model-estimation approaches were robust and accounted for the hierarchical structure of estimated parameters. Improvements in reliability generalized to other datasets and greatly reduced the sample size needed to find a relationship between model-based planning and compulsivity in an independent dataset. These results indicate that computational psychiatry measures such as model-based planning can reliably measure latent decision-making processes, but when doing so must assess the ability of methods to estimate complex models from limited data."
  },
  {
    "pmid": 30882043,
    "title": "Behavioural evidence for parallel outcome-sensitive and outcome-insensitive Pavlovian learning systems in humans.",
    "abstract": "There is a dichotomy in instrumental conditioning between goal-directed actions and habits that are distinguishable on the basis of their relative sensitivity to changes in outcome value. It is less clear whether a similar distinction applies in Pavlovian conditioning, where responses have been found to be predominantly outcome sensitive. To test for both devaluation insensitive and devaluation sensitive Pavlovian conditioning in humans, we conducted four experiments combining Pavlovian conditioning and outcome devaluation procedures while measuring multiple conditioned responses. Our results suggest that Pavlovian conditioning involves two distinct types of learning: one that learns the current value of the outcome which is sensitive to devaluation, and one that learns about the spatial localisation of the outcome which is insensitive to devaluation. Our findings have implications for the mechanistic understanding of Pavlovian conditioning and provide a more nuanced understanding of Pavlovian mechanisms that might contribute to a number of psychiatric disorders."
  },
  {
    "pmid": 31302035,
    "title": "Using Latent Class Growth Modeling to Examine Longitudinal Patterns of Body Mass Index Change from Adolescence to Adulthood.",
    "abstract": "Few studies use longitudinal designs to assess patterns of body mass index (BMI) change from adolescence to adulthood or incorporate severe obesity as a unique subgroup. To examine patterns of BMI trajectories from adolescence to adulthood and identify demographic characteristics associated with each BMI trajectory pattern. Height, weight, and demographic characteristics were drawn from Waves I to V of the nationally representative school-based sample of the National Longitudinal Study of Adolescent to Adult Health (Add Health) conducted from 1994 to 2018 (data collection is ongoing). Participants included 3,315 (55.5% female) subjects responding to in-home interviews across all five Waves of Add Health. BMI at each wave modeled over time. Latent class growth modeling and logistic regression analysis using population sample weights. Five classes of weight patterns best fit the sample. Twenty-nine percent of the sample had an always healthy BMI (class 1) and 34.9% changed from healthy weight to overweight (class 2). Moving from healthy weight to obese comprised 21.8% of the sample (class 3). BMI patterns increasing from overweight to obese (class 4) and from obese to severely obese (class 5) comprised 7.6% and 7.1% of the sample, respectively. Weight change was similar for males and females with some racial or ethnic minority participants more likely to be severely obese in adulthood. Results emphasize the importance of tracking weight longitudinally and point to a nationally representative trend of increasing BMI during the transition to adulthood. There was no substantive decreasing trend identified in the sample. Findings highlight the need for effective early and ongoing intervention and prevention strategies and can aid in identification of vulnerable youth who are at the highest risk for moving to problematic weight categories."
  }
]