[
  {
    "doi": "10.3389/fnut.2022.1021868",
    "title": "The role of reinforcement learning and value-based decision-making frameworks in understanding food choice and eating behaviors",
    "abstract": "The obesogenic food environment includes easy access to highly-palatable, energy-dense, Òultra-processedÓ foods that are heavily marketed to consumers; therefore, it is critical to understand the neurocognitive processes the underlie overeating in response to environmental food-cues (e.g., food images, food branding/advertisements). Eating habits are learned through reinforcement, which is the process through which environmental food cues become valued and influence behavior. This process is supported by multiple behavioral control systems (e.g., Pavlovian, Habitual, Goal-Directed). Therefore, using neurocognitive frameworks for reinforcement learning and value-based decision-making can improve our understanding of food-choice and eating behaviors. Specifically, the role of reinforcement learning in eating behaviors was considered using the frameworks of (1) Sign-versus Goal-Tracking Phenotypes; (2) Model-Free versus Model-Based; and (3) the Utility or Value-Based Model. The sign-and goal-tracking phenotypes may contribute a mechanistic insight on the role of food-cue incentive salience in two prevailing models of overconsumptionÐthe Extended Behavioral Susceptibility Theory and the Reactivity to Embedded Food Cues in Advertising Model. Similarly, the model-free versus model-based framework may contribute insight to the Extended Behavioral Susceptibility Theory and the Healthy Food Promotion Model. Finally, the value-based model provides a framework for understanding how all three learning systems are integrated to influence food choice. Together, these frameworks can provide mechanistic insight to existing models of food choice and overconsumption and may contribute to the development of future prevention and treatment efforts."
  },
  {
    "doi": "10.1109/DESSERT.2019.8770016",
    "title": "A Machine Learning Approach for Predicting Weight Gain Risks in Young Adults",
    "abstract": "Individuals developing signs of weight gain or obesity are at a risk of developing serious illnesses such as type 2 diabetes, respiratory problems, coronary heart disease and stroke. Physical activity and healthy eating can be a fundamental component to maintain a healthy lifestyle. Therefore, detecting childhood obesity is of paramount importance. This paper utilises the vast amount of data available via the millennium cohort study. Various regression methods and artificial neural network models have been evaluated to predict the teenager BMI from earlier BMI values. The results obtained are encouraging and a prediction accuracy of over 90% has been achieved. Various issues relating to data mining and prediction accuracy are discussed."
  },
  {
    "doi": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8087151/",
    "title": "Mapping sign-tracking and goal-tracking onto human behaviors",
    "abstract": "As evidenced through classic Pavlovian learning mechanisms, environmental cues can become incentivized and influence behavior. These stimulus-outcome associations are relevant in everyday life but may be particularly important for the development of impulse control disorders including addiction. Rodent studies have elucidated specific learning profiles termed Ôsign-trackingÕ and Ôgoal-trackingÕ which map onto individual differences in impulsivity and other behaviors associated with impulse control disordersÕ etiology, course, and relapse. Whereas goal-trackers are biased toward the outcome, sign-trackers fixate on features that are associated with but not necessary for achieving an outcome; a pattern of behavior that often leads to escalation of reward-seeking that can be maladaptive. The vast majority of the sign- and goal-tracking research has been conducted using rodent models and very few have bridged this concept into the domain of human behavior. In this review, we discuss the attributes of sign- and goal-tracking profiles, how these are manifested neurobiologically, and how these distinct learning styles could be an important tool for clinical interventions in human addiction."
  }
]